[Survived] BooleanLiteral
src/arrays/selectionSort.ts:8:18
 }
 export const selectionSort = (arr: number[]): number[] => {
   if (arr.length < 2) return arr
-  let makeSwap = true
+  let makeSwap = false
   let minIndex = 0
   for (let i = 1; i < arr.length; i++) {

[Killed] BooleanLiteral
src/arrays/selectionSort.ts:13:18
   for (let i = 1; i < arr.length; i++) {
     if (arr[minIndex] > arr[i]) {
       minIndex = i
-      makeSwap = false
+      makeSwap = true
     }
   }
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] ConditionalExpression
src/arrays/selectionSort.ts:17:7
     }
   }
   const newArr = [...arr]
-  if (!makeSwap) {
+  if (false) {
     swap(newArr, 0, minIndex)
   }
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] BooleanLiteral
src/arrays/selectionSort.ts:17:7
     }
   }
   const newArr = [...arr]
-  if (!makeSwap) {
+  if (makeSwap) {
     swap(newArr, 0, minIndex)
   }
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]
