[Killed] BlockStatement
src/timing/throttle.ts:17:32
   let timeOut: NodeJS.Timeout | undefined
 
   return function throttleFn(...args: Parameters<T>): ReturnType<AnyFunction> {
-    if (timeOut !== undefined) {
-      return
-    }
+    if (timeOut !== undefined) {}
     timeOut = setTimeout(() => {
       timeOut = undefined
killedBy: throttle generic function should be called once
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/timing/throttle.ts:17:9
   let timeOut: NodeJS.Timeout | undefined
 
   return function throttleFn(...args: Parameters<T>): ReturnType<AnyFunction> {
-    if (timeOut !== undefined) {
+    if (false) {
       return
     }
killedBy: throttle generic function should be called once
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/timing/throttle.ts:20:32
     if (timeOut !== undefined) {
       return
     }
-    timeOut = setTimeout(() => {
-      timeOut = undefined
-    }, delay)
+    timeOut = setTimeout(() => {}, delay)
 
     return cb(args)
killedBy: throttle generic function should be called twice
statusReason: expected "spy" to be called 2 times, but got 1 times
