[Killed] ConditionalExpression
src/arrays/insertionSort.ts:2:7
 export const insertionSort = (arr: number[]): number[] => {
-  if (arr.length < 2) return arr
+  if (false) return arr
   const newArr = [...arr]
   for (let i = 1; i < newArr.length; i++) {
killedBy: insertionSort should return empty array for empty input
statusReason: expected [] to be [] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: []
Received: serializes to the same string

[Killed] EqualityOperator
src/arrays/insertionSort.ts:4:19
 export const insertionSort = (arr: number[]): number[] => {
   if (arr.length < 2) return arr
   const newArr = [...arr]
-  for (let i = 1; i < newArr.length; i++) {
+  for (let i = 1; i >= newArr.length; i++) {
     const current = newArr[i]
     let j = i - 1
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] BlockStatement
src/arrays/insertionSort.ts:4:43
 export const insertionSort = (arr: number[]): number[] => {
   if (arr.length < 2) return arr
   const newArr = [...arr]
-  for (let i = 1; i < newArr.length; i++) {
-    const current = newArr[i]
-    let j = i - 1
-    while (j >= 0 && newArr[j] > current) {
-      newArr[j + 1] = newArr[j]
-      j--
-    }
-    newArr[j + 1] = current
-  }
+  for (let i = 1; i < newArr.length; i++) {}
   return newArr
 }
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Timeout] ArithmeticOperator
src/arrays/insertionSort.ts:6:13
   const newArr = [...arr]
   for (let i = 1; i < newArr.length; i++) {
     const current = newArr[i]
-    let j = i - 1
+    let j = i + 1
     while (j >= 0 && newArr[j] > current) {
       newArr[j + 1] = newArr[j]

[Killed] EqualityOperator
src/arrays/insertionSort.ts:7:22
   for (let i = 1; i < newArr.length; i++) {
     const current = newArr[i]
     let j = i - 1
-    while (j >= 0 && newArr[j] > current) {
+    while (j >= 0 && newArr[j] <= current) {
       newArr[j + 1] = newArr[j]
       j--
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] ConditionalExpression
src/arrays/insertionSort.ts:7:12
   for (let i = 1; i < newArr.length; i++) {
     const current = newArr[i]
     let j = i - 1
-    while (j >= 0 && newArr[j] > current) {
+    while (false) {
       newArr[j + 1] = newArr[j]
       j--
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] ArithmeticOperator
src/arrays/insertionSort.ts:8:14
     const current = newArr[i]
     let j = i - 1
     while (j >= 0 && newArr[j] > current) {
-      newArr[j + 1] = newArr[j]
+      newArr[j - 1] = newArr[j]
       j--
     }
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 2, 2, '-1': 5 ] to strictly equal [ 2, 5 ]

[Timeout] UpdateOperator
src/arrays/insertionSort.ts:9:7
     let j = i - 1
     while (j >= 0 && newArr[j] > current) {
       newArr[j + 1] = newArr[j]
-      j--
+      j++
     }
     newArr[j + 1] = current

[Killed] ArithmeticOperator
src/arrays/insertionSort.ts:11:12
       newArr[j + 1] = newArr[j]
       j--
     }
-    newArr[j + 1] = current
+    newArr[j - 1] = current
   }
   return newArr
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 5, '-2': 2 ] to strictly equal [ 2, 5 ]
