[Killed] BlockStatement
src/timing/debounce.ts:12:60
 export const debounce = <T extends AnyFunction>(cb: T, delay: number): ((...args: Parameters<T>) => void) => {
   let timeOut: NodeJS.Timeout
 
-  return function debounceFn(...args: Parameters<T>): void {
-    // if (timeOut !== undefined) {
-    //   clearTimeout(timeOut)
-    // }
-    clearTimeout(timeOut)
-    timeOut = setTimeout(() => cb(args), delay)
-  }
+  return function debounceFn(...args: Parameters<T>): void {}
 }
 
killedBy: debounce generic function should be called once
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/timing/debounce.ts:17:26
     //   clearTimeout(timeOut)
     // }
     clearTimeout(timeOut)
-    timeOut = setTimeout(() => cb(args), delay)
+    timeOut = setTimeout(() => undefined, delay)
   }
 }
killedBy: debounce generic function should be called once
statusReason: expected "spy" to be called 1 times, but got 0 times
