[Killed] BlockStatement
src/arrays/insertionSort.ts:1:59
-export const insertionSort = (arr: number[]): number[] => {
-  if (arr.length < 2) return arr
-  const newArr = [...arr]
-  /* [5, 3, 4] */
-  //  0, 1, 2
-  for (let i = 1; i < newArr.length; i++) {
-    // current = 3
-    const current = newArr[i]
-    // j = 0
-    let j = i - 1
-    // newArr[j] (5) > current (3)
-    while (j >= 0 && newArr[j] > current) {
-      // newArr[1] = 5
-      newArr[j + 1] = newArr[j]
-      // -1
-      j--
-    }
-    // newArr[-1 + 1 (0)] = 3
-    newArr[j + 1] = current
-  }
-  return newArr
-}
+export const insertionSort = (arr: number[]): number[] => {}
 
killedBy: insertionSort insertionSort([]) should be []
statusReason: expected undefined to strictly equal []

[Killed] ConditionalExpression
src/arrays/insertionSort.ts:2:7
 export const insertionSort = (arr: number[]): number[] => {
-  if (arr.length < 2) return arr
+  if (true) return arr
   const newArr = [...arr]
   /* [5, 3, 4] */
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] EqualityOperator
src/arrays/insertionSort.ts:2:7
 export const insertionSort = (arr: number[]): number[] => {
-  if (arr.length < 2) return arr
+  if (arr.length >= 2) return arr
   const newArr = [...arr]
   /* [5, 3, 4] */
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] ArrayDeclaration
src/arrays/insertionSort.ts:3:18
 export const insertionSort = (arr: number[]): number[] => {
   if (arr.length < 2) return arr
-  const newArr = [...arr]
+  const newArr = []
   /* [5, 3, 4] */
   //  0, 1, 2
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [] to strictly equal [ 2, 5 ]

[Killed] EqualityOperator
src/arrays/insertionSort.ts:6:19
   const newArr = [...arr]
   /* [5, 3, 4] */
   //  0, 1, 2
-  for (let i = 1; i < newArr.length; i++) {
+  for (let i = 1; i >= newArr.length; i++) {
     // current = 3
     const current = newArr[i]
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] ConditionalExpression
src/arrays/insertionSort.ts:6:19
   const newArr = [...arr]
   /* [5, 3, 4] */
   //  0, 1, 2
-  for (let i = 1; i < newArr.length; i++) {
+  for (let i = 1; false; i++) {
     // current = 3
     const current = newArr[i]
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Timeout] ArithmeticOperator
src/arrays/insertionSort.ts:10:13
     // current = 3
     const current = newArr[i]
     // j = 0
-    let j = i - 1
+    let j = i + 1
     // newArr[j] (5) > current (3)
     while (j >= 0 && newArr[j] > current) {

[Killed] LogicalOperator
src/arrays/insertionSort.ts:12:12
     // j = 0
     let j = i - 1
     // newArr[j] (5) > current (3)
-    while (j >= 0 && newArr[j] > current) {
+    while (j >= 0 || newArr[j] > current) {
       // newArr[1] = 5
       newArr[j + 1] = newArr[j]
killedBy: insertionSort insertionSort([8,3,5,7,1]) should be [1,3,5,7,8]
statusReason: expected [ 1, 7, 5, 3, 8 ] to strictly equal [ 1, 3, 5, 7, 8 ]

[Killed] ConditionalExpression
src/arrays/insertionSort.ts:12:22
     // j = 0
     let j = i - 1
     // newArr[j] (5) > current (3)
-    while (j >= 0 && newArr[j] > current) {
+    while (j >= 0 && true) {
       // newArr[1] = 5
       newArr[j + 1] = newArr[j]
killedBy: insertionSort insertionSort([8,3,5,7,1]) should be [1,3,5,7,8]
statusReason: expected [ 1, 7, 5, 3, 8 ] to strictly equal [ 1, 3, 5, 7, 8 ]

[Killed] ArithmeticOperator
src/arrays/insertionSort.ts:14:14
     // newArr[j] (5) > current (3)
     while (j >= 0 && newArr[j] > current) {
       // newArr[1] = 5
-      newArr[j + 1] = newArr[j]
+      newArr[j - 1] = newArr[j]
       // -1
       j--
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 2, 2, '-1': 5 ] to strictly equal [ 2, 5 ]

[Timeout] UpdateOperator
src/arrays/insertionSort.ts:16:7
       // newArr[1] = 5
       newArr[j + 1] = newArr[j]
       // -1
-      j--
+      j++
     }
     // newArr[-1 + 1 (0)] = 3

[Killed] ArithmeticOperator
src/arrays/insertionSort.ts:19:12
       j--
     }
     // newArr[-1 + 1 (0)] = 3
-    newArr[j + 1] = current
+    newArr[j - 1] = current
   }
   return newArr
killedBy: insertionSort insertionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 5, '-2': 2 ] to strictly equal [ 2, 5 ]
