[Killed] EqualityOperator
src/arrays/merge.ts:6:7
   arr2: T[],
   compare: (left: T, right: T) => boolean
 ): T[] => {
-  if (arr1.length === 0 || arr2.length === 0) return []
+  if (arr1.length !== 0 || arr2.length === 0) return []
   let x = 0
   let j = 0
killedBy: ascMergeSort ascMergeSort([3,2]) should be [2,3]
statusReason: expected [] to strictly equal [ 2, 3 ]

[Killed] LogicalOperator
src/arrays/merge.ts:6:7
   arr2: T[],
   compare: (left: T, right: T) => boolean
 ): T[] => {
-  if (arr1.length === 0 || arr2.length === 0) return []
+  if (arr1.length === 0 && arr2.length === 0) return []
   let x = 0
   let j = 0
killedBy: merge merge([2], []) should be []
statusReason: expected [ 2 ] to strictly equal []

[Killed] ArrayDeclaration
src/arrays/merge.ts:11:20
   let j = 0
   let finalArr = []
   const leftArr = [...arr1]
-  const rightArr = [...arr2]
+  const rightArr = []
 
   while (x < leftArr.length && j < rightArr.length) {
killedBy: merge merge([2], [2]) should be [2,2]
statusReason: expected [ 2 ] to strictly equal [ 2, 2 ]

[Killed] ConditionalExpression
src/arrays/merge.ts:13:10
   const leftArr = [...arr1]
   const rightArr = [...arr2]
 
-  while (x < leftArr.length && j < rightArr.length) {
+  while (true && j < rightArr.length) {
     if (compare(leftArr[x], rightArr[j])) {
       finalArr.push(leftArr[x])
killedBy: desObjMergeSort desObjMergeSort([{"id":5,"name":"test5"},{"id":2,"name":"test2"},{"id":3,"name":"test3"},{"id":15,"name":"test15"},{"id":9,"name":"test9"}]) should be [{"id":2,"name":"test2"},{"id":3,
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/arrays/merge.ts:13:10
   const leftArr = [...arr1]
   const rightArr = [...arr2]
 
-  while (x < leftArr.length && j < rightArr.length) {
+  while (x >= leftArr.length && j < rightArr.length) {
     if (compare(leftArr[x], rightArr[j])) {
       finalArr.push(leftArr[x])
killedBy: merge merge([3], [2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] ConditionalExpression
src/arrays/merge.ts:14:9
   const rightArr = [...arr2]
 
   while (x < leftArr.length && j < rightArr.length) {
-    if (compare(leftArr[x], rightArr[j])) {
+    if (true) {
       finalArr.push(leftArr[x])
       x++
killedBy: merge merge([3], [2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] ConditionalExpression
src/arrays/merge.ts:14:9
   const rightArr = [...arr2]
 
   while (x < leftArr.length && j < rightArr.length) {
-    if (compare(leftArr[x], rightArr[j])) {
+    if (false) {
       finalArr.push(leftArr[x])
       x++
killedBy: merge merge([1,4], [2,5]) should be [1,2,4,5]
statusReason: expected [ 2, 5, 1, 4 ] to strictly equal [ 1, 2, 4, 5 ]

[Killed] UpdateOperator
src/arrays/merge.ts:16:7
   while (x < leftArr.length && j < rightArr.length) {
     if (compare(leftArr[x], rightArr[j])) {
       finalArr.push(leftArr[x])
-      x++
+      x--
     } else {
       finalArr.push(rightArr[j])
killedBy: ascMergeSort ascMergeSort([9,1,3]) should be [1,3,9]
statusReason: expected [ 1, 3, 1, 9 ] to strictly equal [ 1, 3, 9 ]

[Timeout] BlockStatement
src/arrays/merge.ts:17:12
     if (compare(leftArr[x], rightArr[j])) {
       finalArr.push(leftArr[x])
       x++
-    } else {
-      finalArr.push(rightArr[j])
-      j++
-    }
+    } else {}
   }
 

[Timeout] UpdateOperator
src/arrays/merge.ts:19:7
       x++
     } else {
       finalArr.push(rightArr[j])
-      j++
+      j--
     }
   }

[Killed] ConditionalExpression
src/arrays/merge.ts:23:7
     }
   }
 
-  if (x < leftArr.length) {
+  if (false) {
     finalArr = finalArr.concat(leftArr.splice(x))
   }
killedBy: merge merge([2], [2]) should be [2,2]
statusReason: expected [ 2 ] to strictly equal [ 2, 2 ]

[Killed] BlockStatement
src/arrays/merge.ts:23:27
     }
   }
 
-  if (x < leftArr.length) {
-    finalArr = finalArr.concat(leftArr.splice(x))
-  }
+  if (x < leftArr.length) {}
   if (j < rightArr.length) {
     finalArr = finalArr.concat(rightArr.splice(j))
killedBy: ascMergeSort ascMergeSort([3,2]) should be [2,3]
statusReason: expected [ 2 ] to strictly equal [ 2, 3 ]

[Killed] EqualityOperator
src/arrays/merge.ts:26:7
   if (x < leftArr.length) {
     finalArr = finalArr.concat(leftArr.splice(x))
   }
-  if (j < rightArr.length) {
+  if (j >= rightArr.length) {
     finalArr = finalArr.concat(rightArr.splice(j))
   }
killedBy: ascMergeSort ascMergeSort([9,1,3]) should be [1,3,9]
statusReason: expected [ 1, 9 ] to strictly equal [ 1, 3, 9 ]

[Killed] BlockStatement
src/arrays/merge.ts:26:28
   if (x < leftArr.length) {
     finalArr = finalArr.concat(leftArr.splice(x))
   }
-  if (j < rightArr.length) {
-    finalArr = finalArr.concat(rightArr.splice(j))
-  }
+  if (j < rightArr.length) {}
 
   return finalArr
killedBy: ascMergeSort ascMergeSort([9,1,3]) should be [1,3,9]
statusReason: expected [ 1, 9 ] to strictly equal [ 1, 3, 9 ]
