[Killed] BlockStatement
src/arrays/mergeSort.ts:7:11
 export const mergeSort = <T>(
   arr: T[],
   compare: (left: T, right: T) => boolean
-): T[] => {
-  if (arr.length <= 1) return arr
-
-  const sort = (array: T[]): T[] => {
-    if (array.length <= 1) return array
-    const leftSide = array.slice(0, Math.floor(array.length / 2))
-    const rightSide = array.slice(Math.floor(array.length / 2))
-    return merge(sort(leftSide), sort(rightSide), compare)
-  }
-
-  return sort(arr)
-}
+): T[] => {}
 
killedBy: ascMergeSort ascMergeSort([]) should be []
statusReason: expected undefined to strictly equal []

[Killed] EqualityOperator
src/arrays/mergeSort.ts:8:7
   arr: T[],
   compare: (left: T, right: T) => boolean
 ): T[] => {
-  if (arr.length <= 1) return arr
+  if (arr.length > 1) return arr
 
   const sort = (array: T[]): T[] => {
killedBy: ascMergeSort ascMergeSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] ConditionalExpression
src/arrays/mergeSort.ts:8:7
   arr: T[],
   compare: (left: T, right: T) => boolean
 ): T[] => {
-  if (arr.length <= 1) return arr
+  if (true) return arr
 
   const sort = (array: T[]): T[] => {
killedBy: ascMergeSort ascMergeSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] BlockStatement
src/arrays/mergeSort.ts:10:37
 ): T[] => {
   if (arr.length <= 1) return arr
 
-  const sort = (array: T[]): T[] => {
-    if (array.length <= 1) return array
-    const leftSide = array.slice(0, Math.floor(array.length / 2))
-    const rightSide = array.slice(Math.floor(array.length / 2))
-    return merge(sort(leftSide), sort(rightSide), compare)
-  }
+  const sort = (array: T[]): T[] => {}
 
   return sort(arr)
killedBy: ascMergeSort ascMergeSort([3,2]) should be [2,3]
statusReason: expected undefined to strictly equal [ 2, 3 ]

[Killed] ConditionalExpression
src/arrays/mergeSort.ts:11:9
   if (arr.length <= 1) return arr
 
   const sort = (array: T[]): T[] => {
-    if (array.length <= 1) return array
+    if (true) return array
     const leftSide = array.slice(0, Math.floor(array.length / 2))
     const rightSide = array.slice(Math.floor(array.length / 2))
killedBy: ascMergeSort ascMergeSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] EqualityOperator
src/arrays/mergeSort.ts:11:9
   if (arr.length <= 1) return arr
 
   const sort = (array: T[]): T[] => {
-    if (array.length <= 1) return array
+    if (array.length > 1) return array
     const leftSide = array.slice(0, Math.floor(array.length / 2))
     const rightSide = array.slice(Math.floor(array.length / 2))
killedBy: ascMergeSort ascMergeSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Timeout] MethodExpression
src/arrays/mergeSort.ts:12:22
 
   const sort = (array: T[]): T[] => {
     if (array.length <= 1) return array
-    const leftSide = array.slice(0, Math.floor(array.length / 2))
+    const leftSide = array
     const rightSide = array.slice(Math.floor(array.length / 2))
     return merge(sort(leftSide), sort(rightSide), compare)

[Timeout] ArithmeticOperator
src/arrays/mergeSort.ts:12:48
 
   const sort = (array: T[]): T[] => {
     if (array.length <= 1) return array
-    const leftSide = array.slice(0, Math.floor(array.length / 2))
+    const leftSide = array.slice(0, Math.floor(array.length * 2))
     const rightSide = array.slice(Math.floor(array.length / 2))
     return merge(sort(leftSide), sort(rightSide), compare)

[Killed] ArithmeticOperator
src/arrays/mergeSort.ts:13:46
   const sort = (array: T[]): T[] => {
     if (array.length <= 1) return array
     const leftSide = array.slice(0, Math.floor(array.length / 2))
-    const rightSide = array.slice(Math.floor(array.length / 2))
+    const rightSide = array.slice(Math.floor(array.length * 2))
     return merge(sort(leftSide), sort(rightSide), compare)
   }
killedBy: ascMergeSort ascMergeSort([3,2]) should be [2,3]
statusReason: expected [] to strictly equal [ 2, 3 ]

[Timeout] MethodExpression
src/arrays/mergeSort.ts:13:23
   const sort = (array: T[]): T[] => {
     if (array.length <= 1) return array
     const leftSide = array.slice(0, Math.floor(array.length / 2))
-    const rightSide = array.slice(Math.floor(array.length / 2))
+    const rightSide = array
     return merge(sort(leftSide), sort(rightSide), compare)
   }
