[Killed] BlockStatement
src/arrays/quickSort.ts:8:14
   start: number = 0,
   end: number = arr.length,
   compare: (left: T, right: T) => boolean
-): number => {
-  const pivot = arr[start]
-  let swapIndex = start
-  for (let x = start + 1; x <= end; x++) {
-    if (compare(arr[x], pivot)) {
-      swapIndex++
-      if (swapIndex < x) {
-        swap(arr, swapIndex, x)
-      }
-    }
-  }
-  if (swapIndex > 0) {
-    swap(arr, start, swapIndex)
-  }
-  return swapIndex
-}
+): number => {}
 
 export const quickSort = <T>(
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] EqualityOperator
src/arrays/quickSort.ts:11:27
 ): number => {
   const pivot = arr[start]
   let swapIndex = start
-  for (let x = start + 1; x <= end; x++) {
+  for (let x = start + 1; x > end; x++) {
     if (compare(arr[x], pivot)) {
       swapIndex++
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] ConditionalExpression
src/arrays/quickSort.ts:11:27
 ): number => {
   const pivot = arr[start]
   let swapIndex = start
-  for (let x = start + 1; x <= end; x++) {
+  for (let x = start + 1; false; x++) {
     if (compare(arr[x], pivot)) {
       swapIndex++
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] ConditionalExpression
src/arrays/quickSort.ts:12:9
   const pivot = arr[start]
   let swapIndex = start
   for (let x = start + 1; x <= end; x++) {
-    if (compare(arr[x], pivot)) {
+    if (true) {
       swapIndex++
       if (swapIndex < x) {
killedBy: ascuickSort ascquickSort([5,10,3,17,8]) should be [3,5,8,10,17]
statusReason: expected [ 10, 3, 17, 8, 5 ] to strictly equal [ 3, 5, 8, 10, 17 ]

[Killed] ConditionalExpression
src/arrays/quickSort.ts:12:9
   const pivot = arr[start]
   let swapIndex = start
   for (let x = start + 1; x <= end; x++) {
-    if (compare(arr[x], pivot)) {
+    if (false) {
       swapIndex++
       if (swapIndex < x) {
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] UpdateOperator
src/arrays/quickSort.ts:13:7
   let swapIndex = start
   for (let x = start + 1; x <= end; x++) {
     if (compare(arr[x], pivot)) {
-      swapIndex++
+      swapIndex--
       if (swapIndex < x) {
         swap(arr, swapIndex, x)
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, undefined, '-1': 2 ] to strictly equal [ 2, 3 ]

[Killed] ConditionalExpression
src/arrays/quickSort.ts:14:11
   for (let x = start + 1; x <= end; x++) {
     if (compare(arr[x], pivot)) {
       swapIndex++
-      if (swapIndex < x) {
+      if (false) {
         swap(arr, swapIndex, x)
       }
killedBy: ascuickSort ascquickSort([5,10,3,17,8]) should be [3,5,8,10,17]
statusReason: expected [ 10, 5, 3, 8, 17 ] to strictly equal [ 3, 5, 8, 10, 17 ]

[Killed] EqualityOperator
src/arrays/quickSort.ts:14:11
   for (let x = start + 1; x <= end; x++) {
     if (compare(arr[x], pivot)) {
       swapIndex++
-      if (swapIndex < x) {
+      if (swapIndex >= x) {
         swap(arr, swapIndex, x)
       }
killedBy: ascuickSort ascquickSort([5,10,3,17,8]) should be [3,5,8,10,17]
statusReason: expected [ 10, 5, 3, 8, 17 ] to strictly equal [ 3, 5, 8, 10, 17 ]

[Killed] EqualityOperator
src/arrays/quickSort.ts:19:7
       }
     }
   }
-  if (swapIndex > 0) {
+  if (swapIndex <= 0) {
     swap(arr, start, swapIndex)
   }
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] ConditionalExpression
src/arrays/quickSort.ts:19:7
       }
     }
   }
-  if (swapIndex > 0) {
+  if (false) {
     swap(arr, start, swapIndex)
   }
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] ArithmeticOperator
src/arrays/quickSort.ts:29:19
   arr: T[],
   compare: (left: T, right: T) => boolean,
   left: number = 0,
-  right: number = arr.length - 1
+  right: number = arr.length + 1
 ): T[] => {
   if (left < right) {
killedBy: ascObjQuickSort ascObjQuickSort([{"id":5,"name":"test5"},{"id":2,"name":"test2"},{"id":3,"name":"test3"},{"id":15,"name":"test15"},{"id":9,"name":"test9"}]) should be [{"id":2,"name":"test2"},{"id":3,
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/arrays/quickSort.ts:30:11
   compare: (left: T, right: T) => boolean,
   left: number = 0,
   right: number = arr.length - 1
-): T[] => {
-  if (left < right) {
-    const pivotMoves = pivot(arr, left, right, compare)
-    if (pivotMoves > 0) {
-      quickSort(arr, compare, left, pivotMoves - 1)
-      quickSort(arr, compare, pivotMoves + 1, right)
-    }
-  }
-  return arr
-}
+): T[] => {}
 
killedBy: ascuickSort ascquickSort([]) should be []
statusReason: expected undefined to strictly equal []

[Killed] ConditionalExpression
src/arrays/quickSort.ts:31:7
   left: number = 0,
   right: number = arr.length - 1
 ): T[] => {
-  if (left < right) {
+  if (false) {
     const pivotMoves = pivot(arr, left, right, compare)
     if (pivotMoves > 0) {
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] BlockStatement
src/arrays/quickSort.ts:31:21
   left: number = 0,
   right: number = arr.length - 1
 ): T[] => {
-  if (left < right) {
-    const pivotMoves = pivot(arr, left, right, compare)
-    if (pivotMoves > 0) {
-      quickSort(arr, compare, left, pivotMoves - 1)
-      quickSort(arr, compare, pivotMoves + 1, right)
-    }
-  }
+  if (left < right) {}
   return arr
 }
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] EqualityOperator
src/arrays/quickSort.ts:33:9
 ): T[] => {
   if (left < right) {
     const pivotMoves = pivot(arr, left, right, compare)
-    if (pivotMoves > 0) {
+    if (pivotMoves <= 0) {
       quickSort(arr, compare, left, pivotMoves - 1)
       quickSort(arr, compare, pivotMoves + 1, right)
killedBy: ascuickSort ascquickSort([9,1,3]) should be [1,3,9]
statusReason: expected [ 3, 1, 9 ] to strictly equal [ 1, 3, 9 ]

[Killed] BlockStatement
src/arrays/quickSort.ts:33:25
 ): T[] => {
   if (left < right) {
     const pivotMoves = pivot(arr, left, right, compare)
-    if (pivotMoves > 0) {
-      quickSort(arr, compare, left, pivotMoves - 1)
-      quickSort(arr, compare, pivotMoves + 1, right)
-    }
+    if (pivotMoves > 0) {}
   }
   return arr
killedBy: ascuickSort ascquickSort([9,1,3]) should be [1,3,9]
statusReason: expected [ 3, 1, 9 ] to strictly equal [ 1, 3, 9 ]

[Timeout] ArithmeticOperator
src/arrays/quickSort.ts:34:37
   if (left < right) {
     const pivotMoves = pivot(arr, left, right, compare)
     if (pivotMoves > 0) {
-      quickSort(arr, compare, left, pivotMoves - 1)
+      quickSort(arr, compare, left, pivotMoves + 1)
       quickSort(arr, compare, pivotMoves + 1, right)
     }

[Killed] ArithmeticOperator
src/arrays/quickSort.ts:35:31
     const pivotMoves = pivot(arr, left, right, compare)
     if (pivotMoves > 0) {
       quickSort(arr, compare, left, pivotMoves - 1)
-      quickSort(arr, compare, pivotMoves + 1, right)
+      quickSort(arr, compare, pivotMoves - 1, right)
     }
   }
killedBy: ascuickSort ascquickSort([5,10,3,17,8]) should be [3,5,8,10,17]
statusReason: expected [ 3, 5, 10, 17, 8 ] to strictly equal [ 3, 5, 8, 10, 17 ]
