[Killed] BlockStatement
src/arrays/searchIndex.ts:1:68
-export const searchIndex = (arr: number[], num: number): number => {
-  if (arr.length === 0) return -1
-  let min = 0
-  let max = arr.length - 1
-
-  while (min <= max) {
-    const middle = Math.floor((min + max) / 2)
-    if (arr[middle] < num) {
-      min = middle + 1
-    } else if (arr[middle] > num) {
-      max = middle - 1
-    } else {
-      return middle
-    }
-  }
-
-  return -1
-}
+export const searchIndex = (arr: number[], num: number): number => {}
 
killedBy: searchIndex searchIndex([] 2) should be -1
statusReason: expected undefined to be -1 // Object.is equality

[Killed] EqualityOperator
src/arrays/searchIndex.ts:2:7
 export const searchIndex = (arr: number[], num: number): number => {
-  if (arr.length === 0) return -1
+  if (arr.length !== 0) return -1
   let min = 0
   let max = arr.length - 1
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/arrays/searchIndex.ts:2:7
 export const searchIndex = (arr: number[], num: number): number => {
-  if (arr.length === 0) return -1
+  if (true) return -1
   let min = 0
   let max = arr.length - 1
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/arrays/searchIndex.ts:4:13
 export const searchIndex = (arr: number[], num: number): number => {
   if (arr.length === 0) return -1
   let min = 0
-  let max = arr.length - 1
+  let max = arr.length + 1
 
   while (min <= max) {
killedBy: searchIndex searchIndex([1,2,3,4,5,6,7,8,9] 15) should be -1
statusReason: expected 9 to be -1 // Object.is equality

[Killed] ConditionalExpression
src/arrays/searchIndex.ts:6:10
   let min = 0
   let max = arr.length - 1
 
-  while (min <= max) {
+  while (false) {
     const middle = Math.floor((min + max) / 2)
     if (arr[middle] < num) {
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected -1 to be 1 // Object.is equality

[Killed] EqualityOperator
src/arrays/searchIndex.ts:6:10
   let min = 0
   let max = arr.length - 1
 
-  while (min <= max) {
+  while (min > max) {
     const middle = Math.floor((min + max) / 2)
     if (arr[middle] < num) {
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/arrays/searchIndex.ts:7:32
   let max = arr.length - 1
 
   while (min <= max) {
-    const middle = Math.floor((min + max) / 2)
+    const middle = Math.floor((min - max) / 2)
     if (arr[middle] < num) {
       min = middle + 1
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/arrays/searchIndex.ts:7:31
   let max = arr.length - 1
 
   while (min <= max) {
-    const middle = Math.floor((min + max) / 2)
+    const middle = Math.floor((min + max) * 2)
     if (arr[middle] < num) {
       min = middle + 1
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/arrays/searchIndex.ts:8:9
 
   while (min <= max) {
     const middle = Math.floor((min + max) / 2)
-    if (arr[middle] < num) {
+    if (false) {
       min = middle + 1
     } else if (arr[middle] > num) {
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/arrays/searchIndex.ts:8:9
 
   while (min <= max) {
     const middle = Math.floor((min + max) / 2)
-    if (arr[middle] < num) {
+    if (arr[middle] >= num) {
       min = middle + 1
     } else if (arr[middle] > num) {
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected +0 to be 1 // Object.is equality

[Timeout] ArithmeticOperator
src/arrays/searchIndex.ts:9:13
   while (min <= max) {
     const middle = Math.floor((min + max) / 2)
     if (arr[middle] < num) {
-      min = middle + 1
+      min = middle - 1
     } else if (arr[middle] > num) {
       max = middle - 1

[Killed] EqualityOperator
src/arrays/searchIndex.ts:10:16
     const middle = Math.floor((min + max) / 2)
     if (arr[middle] < num) {
       min = middle + 1
-    } else if (arr[middle] > num) {
+    } else if (arr[middle] >= num) {
       max = middle - 1
     } else {
killedBy: searchIndex searchIndex([1,2] 2) should be 1
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/arrays/searchIndex.ts:10:16
     const middle = Math.floor((min + max) / 2)
     if (arr[middle] < num) {
       min = middle + 1
-    } else if (arr[middle] > num) {
+    } else if (false) {
       max = middle - 1
     } else {
killedBy: searchIndex searchIndex([1,2,3,4,5,7,8,9] 6) should be -1
statusReason: expected 5 to be -1 // Object.is equality

[Timeout] ArithmeticOperator
src/arrays/searchIndex.ts:11:13
     if (arr[middle] < num) {
       min = middle + 1
     } else if (arr[middle] > num) {
-      max = middle - 1
+      max = middle + 1
     } else {
       return middle

[Timeout] BlockStatement
src/arrays/searchIndex.ts:12:12
       min = middle + 1
     } else if (arr[middle] > num) {
       max = middle - 1
-    } else {
-      return middle
-    }
+    } else {}
   }
 

[Killed] UnaryOperator
src/arrays/searchIndex.ts:17:10
     }
   }
 
-  return -1
+  return +1
 }
 
killedBy: searchIndex searchIndex([1,2,3,4,5,7,8,9] 6) should be -1
statusReason: expected 1 to be -1 // Object.is equality
