[Killed] BlockStatement
src/arrays/selectionSort.ts:1:71
-const swap = (arr: number[], index1: number, index2: number): void => {
-  const temp = arr[index1]
-  arr[index1] = arr[index2]
-  arr[index2] = temp
-}
+const swap = (arr: number[], index1: number, index2: number): void => {}
 export const selectionSort = (arr: number[]): number[] => {
   if (arr.length < 2) return arr
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] BlockStatement
src/arrays/selectionSort.ts:6:59
   arr[index1] = arr[index2]
   arr[index2] = temp
 }
-export const selectionSort = (arr: number[]): number[] => {
-  if (arr.length < 2) return arr
-  let makeSwap = false
-  let minIndex = 0
-  for (let i = 1; i < arr.length; i++) {
-    if (arr[minIndex] > arr[i]) {
-      minIndex = i
-      makeSwap = true
-    }
-  }
-  const newArr = [...arr]
-  if (makeSwap) {
-    swap(newArr, 0, minIndex)
-  }
-  return [newArr[0]].concat(selectionSort(newArr.slice(1)))
-}
+export const selectionSort = (arr: number[]): number[] => {}
 
killedBy: selectionSort selectionSort([2]) should be [2]
statusReason: expected undefined to strictly equal [ 2 ]

[Killed] EqualityOperator
src/arrays/selectionSort.ts:7:7
   arr[index2] = temp
 }
 export const selectionSort = (arr: number[]): number[] => {
-  if (arr.length < 2) return arr
+  if (arr.length <= 2) return arr
   let makeSwap = false
   let minIndex = 0
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] ConditionalExpression
src/arrays/selectionSort.ts:7:7
   arr[index2] = temp
 }
 export const selectionSort = (arr: number[]): number[] => {
-  if (arr.length < 2) return arr
+  if (true) return arr
   let makeSwap = false
   let minIndex = 0
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Survived] BooleanLiteral
src/arrays/selectionSort.ts:8:18
 }
 export const selectionSort = (arr: number[]): number[] => {
   if (arr.length < 2) return arr
-  let makeSwap = false
+  let makeSwap = true
   let minIndex = 0
   for (let i = 1; i < arr.length; i++) {

[Killed] ConditionalExpression
src/arrays/selectionSort.ts:10:19
   if (arr.length < 2) return arr
   let makeSwap = false
   let minIndex = 0
-  for (let i = 1; i < arr.length; i++) {
+  for (let i = 1; false; i++) {
     if (arr[minIndex] > arr[i]) {
       minIndex = i
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] EqualityOperator
src/arrays/selectionSort.ts:10:19
   if (arr.length < 2) return arr
   let makeSwap = false
   let minIndex = 0
-  for (let i = 1; i < arr.length; i++) {
+  for (let i = 1; i >= arr.length; i++) {
     if (arr[minIndex] > arr[i]) {
       minIndex = i
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] ConditionalExpression
src/arrays/selectionSort.ts:11:9
   let makeSwap = false
   let minIndex = 0
   for (let i = 1; i < arr.length; i++) {
-    if (arr[minIndex] > arr[i]) {
+    if (true) {
       minIndex = i
       makeSwap = true
killedBy: selectionSort selectionSort([8,3,5,7,1]) should be [1,3,5,7,8]
statusReason: expected [ 1, 8, 3, 5, 7 ] to strictly equal [ 1, 3, 5, 7, 8 ]

[Killed] ConditionalExpression
src/arrays/selectionSort.ts:11:9
   let makeSwap = false
   let minIndex = 0
   for (let i = 1; i < arr.length; i++) {
-    if (arr[minIndex] > arr[i]) {
+    if (false) {
       minIndex = i
       makeSwap = true
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] BooleanLiteral
src/arrays/selectionSort.ts:13:18
   for (let i = 1; i < arr.length; i++) {
     if (arr[minIndex] > arr[i]) {
       minIndex = i
-      makeSwap = true
+      makeSwap = false
     }
   }
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] ConditionalExpression
src/arrays/selectionSort.ts:17:7
     }
   }
   const newArr = [...arr]
-  if (makeSwap) {
+  if (false) {
     swap(newArr, 0, minIndex)
   }
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Killed] BlockStatement
src/arrays/selectionSort.ts:17:17
     }
   }
   const newArr = [...arr]
-  if (makeSwap) {
-    swap(newArr, 0, minIndex)
-  }
+  if (makeSwap) {}
   return [newArr[0]].concat(selectionSort(newArr.slice(1)))
 }
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5, 2 ] to strictly equal [ 2, 5 ]

[Timeout] MethodExpression
src/arrays/selectionSort.ts:20:43
   if (makeSwap) {
     swap(newArr, 0, minIndex)
   }
-  return [newArr[0]].concat(selectionSort(newArr.slice(1)))
+  return [newArr[0]].concat(selectionSort(newArr))
 }
 

[Killed] ArrayDeclaration
src/arrays/selectionSort.ts:20:10
   if (makeSwap) {
     swap(newArr, 0, minIndex)
   }
-  return [newArr[0]].concat(selectionSort(newArr.slice(1)))
+  return [].concat(selectionSort(newArr.slice(1)))
 }
 
killedBy: selectionSort selectionSort([5,2]) should be [2,5]
statusReason: expected [ 5 ] to strictly equal [ 2, 5 ]
