[Killed] BlockStatement
src/arrays/swap.ts:1:75
-export const swap = <T>(arr: T[], index1: number, index2: number): T[] => {
-  if (arr.length > 1 && index1 !== index2) {
-    const temp = arr[index1]
-    arr[index1] = arr[index2]
-    arr[index2] = temp
-  }
-  return arr
-}
+export const swap = <T>(arr: T[], index1: number, index2: number): T[] => {}
 
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] EqualityOperator
src/arrays/swap.ts:2:25
 export const swap = <T>(arr: T[], index1: number, index2: number): T[] => {
-  if (arr.length > 1 && index1 !== index2) {
+  if (arr.length > 1 && index1 === index2) {
     const temp = arr[index1]
     arr[index1] = arr[index2]
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]

[Killed] EqualityOperator
src/arrays/swap.ts:2:7
 export const swap = <T>(arr: T[], index1: number, index2: number): T[] => {
-  if (arr.length > 1 && index1 !== index2) {
+  if (arr.length <= 1 && index1 !== index2) {
     const temp = arr[index1]
     arr[index1] = arr[index2]
killedBy: ascuickSort ascquickSort([3,2]) should be [2,3]
statusReason: expected [ 3, 2 ] to strictly equal [ 2, 3 ]
